Tekla Open API Reference for Tekla Structures 2025
RebarSet.BarOrientation Property
 Gets or sets the bar orientation line. If this is non-null, then it is used to orient the bar planes such that the line is parallel to all the planes.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineSegment BarOrientation { get; set; }
Public Property BarOrientation As LineSegment
	Get
	Set
Property Value
Type: LineSegment
See Also
Reference
RebarSet Class
Tekla.Structures.Model Namespace